[
  {
    "serial_number": "87",
    "petition_number": "240/MP/2023",
    "subject": "Petition under Section 79(1)(b) & (f) of the Electricity Act, 2003 read with Regulation 111 of the CERC (Code of Business) regulations, 1999 and article 12 of PPA dated 08.12.2021 for approval of change in law and determination of quantum and mechanism of compensation on account of change in law event. M/s. T.P. Saurya Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/240-MP-2023.pdf",
    "date_of_order": "20.02.2025",
    "date_of_posting": "21.02.2025",
    "category": "Misc."
  },
  {
    "serial_number": "86",
    "petition_number": "30/MP/2023",
    "subject": "Petition under Section 79 of the Electricity Act, 2003 read with Article 12 of the Power Purchase Agreement dated 29.01.2019 entered between Sitac Kabini Renewables Private Limited and the Solar Energy Corporation of India Limited seeking compensation/ revision in tariff due to a Change in Law event. Sitac Kabini Renewables Private Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/30-MP-2023.pdf",
    "date_of_order": "19.02.2025",
    "date_of_posting": "20.02.2025",
    "category": "Misc."
  },
  {
    "serial_number": "85",
    "petition_number": "480/TT/2024",
    "subject": "Approval under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and under Regulation 15(1)(a) and Regulation 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 for the truing-up of transmission tariff for the 2019-24 period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and for the determination of transmission tariff for the 2024-29 period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024 for the Assets under LILO of Purnea-Dalkola 132 kV S/C line and extension at Purnea (PG) Sub-station in Eastern Region. Power Grid Corporation of India Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/480-TT-2024.pdf",
    "date_of_order": "20.02.2025",
    "date_of_posting": "20.02.2025",
    "category": "Transmission"
  },
  {
    "serial_number": "84",
    "petition_number": "268/AT/2024",
    "subject": "Petition under Section 63 of the Electricity Act, 2003 for adoption of tariff for 1200 MW Wind Solar Hybrid Power Projects (Tranche-VIII) connected to the Inter-State Transmission System (ISTS) and selected through competitive bidding process as per the guidelines of the Government of India. Solar Energy Corporation of India Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/268-AT-2024.pdf",
    "date_of_order": "18.02.2025",
    "date_of_posting": "19.02.2025",
    "category": "Adoption"
  },
  {
    "serial_number": "83",
    "petition_number": "436/GT/2020",
    "subject": "Petition for approval of tariff of Talcher Super Thermal Power Station Stage-I (1000 MW) for the period from 2019-24. NTPC Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/436-GT-2020.pdf",
    "date_of_order": "17.02.2025",
    "date_of_posting": "17.02.2025",
    "category": "Generation"
  },
  {
    "serial_number": "82",
    "petition_number": "329/TT/2023",
    "subject": "Approval under Regulation 86 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 1999, and the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019, for the determination of transmission tariff from COD to 31.3.2024 for a transmission asset, namely, 2 Nos. 132 kV GIS line bays at Nirjuli Sub-station for termination of LILO of one circuit of Pare HEP – North Lakhimpur (AEGCL) 132 kV D/C line (Line works under TBCB) under “North Eastern Region Strengthening Scheme-IX”. Power Grid Corporation of India Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/329-TT-2023.pdf",
    "date_of_order": "17.02.2025",
    "date_of_posting": "17.02.2025",
    "category": "Transmission"
  },
  {
    "serial_number": "81",
    "petition_number": "154/TT/2025",
    "subject": "Petition for truing up of the transmission tariff for the 2019-24 tariff period and determination of the transmission tariff for the 2024-29 tariff period for the LILO of 220 kV S/C Panki-Naubasta Transmission Line at Kanpur in Northern Region under Section 62 read with Section 79 (1)(d) of the Electricity Act, 2003 and under Regulation 15 (1)(a) and Regulation 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 read with the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024. Power Grid Corporation of India Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/154-TT-2025.pdf",
    "date_of_order": "17.02.2025",
    "date_of_posting": "17.02.2025",
    "category": "Transmission"
  },
  {
    "serial_number": "80",
    "petition_number": "9/TT/2025",
    "subject": "Approval under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and under Regulation 15(1)(a) and Regulation 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 for the truing-up of transmission tariff for the 2019-24 tariff period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and for the determination of transmission tariff for the 2024-29 tariff period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024 for the Asset under “02nd 315 (3X105) MVA, 400/220 kV Transformer at Indravati (OHPC) Switchyard” in the Eastern Region. Power Grid Corporation of India Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/9-TT-2025.pdf",
    "date_of_order": "17.02.2025",
    "date_of_posting": "17.02.2025",
    "category": "Transmission"
  },
  {
    "serial_number": "79",
    "petition_number": "316/TL/2024",
    "subject": "Application under Sections 14, 15 and 79(1)(e) of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission Licence and other related matters) Regulations, 2024 with respect to grant of Transmission Licence to Rajasthan IV A Power Transmission Limited. Rajasthan IV A Power Transmission Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/316-TL-2024.pdf",
    "date_of_order": "14.02.2025",
    "date_of_posting": "14.02.2025",
    "category": "Licence (Transmission)"
  },
  {
    "serial_number": "78",
    "petition_number": "313/TL/2024",
    "subject": "Application under Sections 14 & 15 of the Electricity Act, 2003 read with the Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission Licence and other related matters) Regulations, 2024 with respect to grant of a transmission licence to Rajasthan IV E Power Transmission Limited. Rajasthan IV E Power Transmission Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/313-TL-2024.pdf",
    "date_of_order": "14.02.2025",
    "date_of_posting": "14.02.2025",
    "category": "Licence (Transmission)"
  },
  {
    "serial_number": "77",
    "petition_number": "150/TD/2025",
    "subject": "Application under Section 15 (1) of the Electricity Act, 2003 read with Regulation 6 (1) of CERC (Procedure, Terms and Conditions for Grant of Trading License and other related matters) Regulations, 2020 for grant of Category V license for Inter-State trading of Electricity in all States and Union Territories of India in accordance with CERC (Procedure, Terms and Conditions for Grant of Trading Licence and other related matters) Regulations, 2020 amended from time to time. Sunsure Power Markets Private Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/150-TD-2025-1.pdf",
    "date_of_order": "14.02.2025",
    "date_of_posting": "14.02.2025",
    "category": "Licence"
  },
  {
    "serial_number": "76",
    "petition_number": "477/TL/2024",
    "subject": "Petition under Section 14 of the Electricity Act, 2003 read with the Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 for the grant of a separate RTM Transmission License to POWERGRID Neemuch Transmission System Limited. POWERGRID Neemuch Transmission System Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/477-TL-2024.pdf",
    "date_of_order": "14.02.2025",
    "date_of_posting": "14.02.2025",
    "category": "Licence (Transmission)"
  },
  {
    "serial_number": "75",
    "petition_number": "225/TL/2024",
    "subject": "Petition under Section-14 & 15 of the Electricity Act, 2003 read with the Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 for Grant of separate Transmission License for Augmentation of 2x500 MVA, 400/230kV transformation capacity (3rd & 4th ICTs) at Karur PS and Implementation of 1 no. of 230kV line bay at Karur 400/230kV PS for interconnection of REGS of M/s Nannai Solar Park Pvt. Ltd. on Regulated Tariff Mechanism (RTM) route. Karur Transmission Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/225-TL-2024-I.pdf",
    "date_of_order": "14.02.2025",
    "date_of_posting": "14.02.2025",
    "category": "Licence (Transmission)"
  },
  {
    "serial_number": "74",
    "petition_number": "Corrigendum to 7/RP/2024",
    "subject": "Review Petition under Section 94 of the Electricity Act, 2003 read with Section 114 of the Code of Civil Procedure, 1908, and Regulation 52 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 seeking review of the order dated 18.1.2024 passed in Petition No.114/MP/2019. 1. GMR Energy Trading Limited, 2. GMR Warora Energy Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/Corri-7-RP-2024.pdf",
    "date_of_order": "13.02.2025",
    "date_of_posting": "13.02.2025",
    "category": "Review"
  },
  {
    "serial_number": "73",
    "petition_number": "10/TT/2025",
    "subject": "Approval under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and Regulations 15(1)(a) and 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 for truing up of the transmission tariff for the 2019-24 tariff period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and the determination of transmission tariff of the 2024-29 tariff period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024 for the Asset under “63 MVAR Line Reactor on 400kV Kolaghat-Rengali line at Rengali Sub-station” in Eastern Region. Power Grid Corporation of India Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/10-TT-2025.pdf",
    "date_of_order": "11.02.2025",
    "date_of_posting": "12.02.2025",
    "category": "Transmission"
  },
  {
    "serial_number": "72",
    "petition_number": "7/TT/2025",
    "subject": "Approval under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and Regulations 15(1)(a) and 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 for truing up of the transmission tariff for the 2019-24 tariff period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and the determination of transmission tariff of the 2024-29 tariff period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024 for the Asset-I: 220 kV Jallandhar-Hamirpur D/C Transmission Line along with associated bays in Northern Region. Power Grid Corporation of India Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/7-TT-2025.pdf",
    "date_of_order": "11.02.2025",
    "date_of_posting": "12.02.2025",
    "category": "Transmission"
  },
  {
    "serial_number": "71",
    "petition_number": "5/TT/2025",
    "subject": "Approval under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and under Regulation 15(1)(a) and Regulation 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 for the truing-up of transmission tariff for the 2019-24 period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and for the determination of transmission tariff for the 2024-29 period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024 for the “Combined Asset: comprising Asset-I: 315 MVA, 400/220 kV ICT at Mandola and Asset-II: 315 MVA, 400/220 kV ICT at Ludhiana under “Spare ICT Scheme” in the Northern Region. Power Grid Corporation of India Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/5-TT-2025.pdf",
    "date_of_order": "11.02.2025",
    "date_of_posting": "12.02.2025",
    "category": "Transmission"
  },
  {
    "serial_number": "70",
    "petition_number": "4/TT/2025",
    "subject": "Approval under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and under Regulation 15(1)(a) and Regulation 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 for the truing-up of transmission tariff for the 2019-24 period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and for the determination of transmission tariff for the 2024-29 period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024 for the “System Strengthening Scheme in Roorkee” in the Northern Region Power Grid Corporation of India Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/4-TT-2025.pdf",
    "date_of_order": "11.02.2025",
    "date_of_posting": "12.02.2025",
    "category": "Transmission"
  },
  {
    "serial_number": "69",
    "petition_number": "37/TT/2025",
    "subject": "Approval under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and under Regulation 15(1)(a) and Regulation 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 for truing up of transmission tariff for the 2019-24 tariff period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and determination of transmission tariff for the 2024-29 tariff period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024 for 400 kV D/C Kaiga-Sirsa transmission line in the Southern Region. Power Grid Corporation of India Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/37-TT-2025.pdf",
    "date_of_order": "11.02.2025",
    "date_of_posting": "12.02.2025",
    "category": "Transmission"
  },
  {
    "serial_number": "68",
    "petition_number": "8/TT/2025",
    "subject": "Petition for truing up of the transmission tariff for the 2019-24 tariff period and determination of the transmission tariff for the 2024-29 tariff period for the Combined Asset: Comprising Asset-1: 315 MVA ICT-III at Ludhiana Sub-station; and Asset-2: Bay extension work at Wagoora Sub-station under “Northern Region System Strengthening Scheme-VII (NRSS-VII)” in Northern Region under Section 62 read with Section 79 (1)(d) of the Electricity Act, 2003 and under Regulation 15 (1)(a) and Regulation 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 read with the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024. Power Grid Corporation of India Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/8-TT-2025.pdf",
    "date_of_order": "11.02.2025",
    "date_of_posting": "12.02.2025",
    "category": "Transmission"
  },
  {
    "serial_number": "67",
    "petition_number": "100/MP/2021 with IA No. 94/2023, 102/MP/2021 with IA No. 97/2023, 308/MP/2023 with IA Nos. 77/2023, 78/2023, 95/2023 & 96/2023",
    "subject": "Petition under Section 142 of the Electricity Act, 2003 read with Regulations 111, 113, and 119 of the Conduct of Business Regulations, 1999 for the execution of Order dated 13.1.2020 passed by this Hon’ble Commission and directions and initiation of appropriate action against the Respondent for non-compliance of the directions issued under Order dated 13.1.2020 in Petition No. 78/MP/2018. Damodar Valley Corporation, Madhya Pradesh Power Management Company Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/100-MP-2021-batch.pdf",
    "date_of_order": "12.02.2025",
    "date_of_posting": "12.02.2025",
    "category": "Misc."
  },
  {
    "serial_number": "66",
    "petition_number": "317/TL/2024",
    "subject": "Application under Sections 14, 15 and 79(1)(e) of the Electricity Act, 2003 read with the Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission Licence and other related matters) Regulations, 2024 with respect to grant of transmission licence to Rajasthan IV C Power Transmission Limited. Rajasthan IV C Power Transmission Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/317-TL-2024-F.pdf",
    "date_of_order": "08.02.2025",
    "date_of_posting": "11.02.2025",
    "category": "Licence (Transmission)"
  },
  {
    "serial_number": "65",
    "petition_number": "189/GT/2020",
    "subject": "Petition under Section 62 and 79 (1) (a) of the Electricity Act, 2003 read with Chapter-V of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 1999 and Chapter-3, Regulation-9 of Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 for approval of tariff of Barauni Thermal Power Station, Stage-I (220 MW) for the period from 1.4.2019 to 31.3.2024. NTPC Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/189-GT-2020.pdf",
    "date_of_order": "10.02.2025",
    "date_of_posting": "10.02.2025",
    "category": "Generation"
  },
  {
    "serial_number": "64",
    "petition_number": "89/GT/2023",
    "subject": "Petition for truing-up of tariff for the period 2014-19 and for determination of tariff for the period 2019-24 in respect of Dadri Loni Road 400 KV D/C dedicated Transmission Line associated with National Capital Thermal Power Station, Dadri-II (980 MW). NTPC Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/89-GT-2023.pdf",
    "date_of_order": "07.02.2025",
    "date_of_posting": "07.02.2025",
    "category": "Generation"
  },
  {
    "serial_number": "63",
    "petition_number": "433/MP/2024",
    "subject": "Petition under Section 79(1) (a) and 79 (1) (b) of the Electricity Act, 2003 seeking approval of the Amendment Agreement dated 16.08.2024 of the Power Purchase Agreement dated 14.08.2024 between NTPC and MSEDCL and the Amendment Agreement dated 16.08.2024 of the Power Sale Agreement dated 14.08.2024 between NTPC and ACME Renewtech Private Limited. NTPC Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/433-MP-2024.pdf",
    "date_of_order": "06.02.2025",
    "date_of_posting": "07.02.2025",
    "category": "Misc."
  },
  {
    "serial_number": "62",
    "petition_number": "112/MP/2025",
    "subject": "Petition under section 79(1)(k) of the Electricity Act, 2003 read with Regulation 13 of Central Electricity Regulatory Commission (Connectivity and General Network Access to the inter-State Transmission System) Regulations, 2022 and Regulation 19(2) & 19(3) of Central Electricity Regulatory Commission (Indian Electricity Grid Code) Regulations, 2023 seeking permission for injection of infirm power beyond 30.09.2024 in case of Parbati–II Hydroelectric Project (800MW). NHPC Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/112-MP-2025.pdf",
    "date_of_order": "07.02.2025",
    "date_of_posting": "07.02.2025",
    "category": "Misc."
  },
  {
    "serial_number": "61",
    "petition_number": "453/TT/2024",
    "subject": "Approval under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and under Regulation 15(1)(a) and Regulation 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 for the truing-up of transmission tariff for the 2019-24 period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and for the determination of transmission tariff for the 2024-29 period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024 for the Combined Asset: 400 kV D/C Gorakhpur-Lucknow transmission line along with its associated bays; and 30% FSC on 400 kV D/C Gorakhpur-Lucknow transmission line at Lucknow along with bays under “Northern Region System Strengthening Scheme-X” in the Northern Region”. Power Grid Corporation of India Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/453-TT-2024.pdf",
    "date_of_order": "06.02.2025",
    "date_of_posting": "07.02.2025",
    "category": "Transmission"
  },
  {
    "serial_number": "60",
    "petition_number": "24/RP/2024\nin\n563/GT/2020",
    "subject": "Review of the Commission’s order dated 24.4.2024 in Petition No. 563/GT/2020 pertaining to truing-up of tariff of Kudgi Super Thermal Power Station (2400 MW) for the period from COD of Unit-I i.e., from 31.7.2017 to 31.3.2019. NTPC Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/24-RP-2024.pdf",
    "date_of_order": "06.02.2025",
    "date_of_posting": "07.02.2025",
    "category": "Review"
  },
  {
    "serial_number": "59",
    "petition_number": "376/TT/2024",
    "subject": "Approval under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and Regulations 15(1)(a) and 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 for truing up of the transmission tariff for the 2019-24 tariff period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and the determination of transmission tariff of the 2024-29 tariff period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024 for the Combined Asset comprising of Asset-I: LILO of both circuits of 400kV D/C Gazuwaka-Vijayawada Transmission Line at Vemagiri and Asset-II: Extension of 400/220 kV Sub-station at Vijayawada under System Strengthening-VI of Southern Region Grid in the Southern Region. Power Grid Corporation of India Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/376-TT-2024.pdf",
    "date_of_order": "06.02.2025",
    "date_of_posting": "07.02.2025",
    "category": "Transmission"
  },
  {
    "serial_number": "58",
    "petition_number": "350/TT/2023",
    "subject": "Approval under Regulation 86 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 1999 and the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 for the determination of transmission tariff from COD to 31.3.2024 for bypassing of Ranchhodpura (GETCO) – Dehgam (PG) 400 kV D/C line at Dehgam (PG) Sub-station and connecting it with Dehgam (PG) – Pirana 400 kV D/C line (one circuit via Nicol) so as to form Ranchhodpura (GETCO) – Pirana (PG) 400 kV D/C line (one circuit via Nicol) under “Scheme for fault level control at Dehgam (PG) & Ranchhodpura (GETCO) Sub-station” in Western Region.” Power Grid Corporation of India Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/350-TT-2023.pdf",
    "date_of_order": "04.02.2025",
    "date_of_posting": "06.02.2025",
    "category": "Transmission"
  },
  {
    "serial_number": "57",
    "petition_number": "437/TL/2024",
    "subject": "Petition under Section 14 of the Electricity Act, 2003 read with the Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission Licence and other related matters) Regulations, 2024 for the grant of a separate RTM Transmission Licence to POWERGRID Bhadla III Transmission Limited. POWERGRID Bhadla III Transmission Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/437-TL-2024.pdf",
    "date_of_order": "31.01.2025",
    "date_of_posting": "31.01.2025",
    "category": "Licence (Transmission)"
  },
  {
    "serial_number": "56",
    "petition_number": "423/AT/2024",
    "subject": "Application under Section 63 of the Electricity Act, 2003 for the adoption of Transmission Charges with respect to the Transmission System being established by Jamnagar Transmission Limited. Jamnagar Transmission Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/423-AT-2024.pdf",
    "date_of_order": "31.01.2025",
    "date_of_posting": "31.01.2025",
    "category": "Adoption"
  },
  {
    "serial_number": "55",
    "petition_number": "387/AT/2024",
    "subject": "Petition under Section 63 of the Electricity Act, 2003 for the adoption of tariff for 900 MW Solar PV Power Projects (Tranche – XI) connected with the Inter-State Transmission System (ISTS) and selected through competitive bidding process as per the Guidelines dated 3.8.2017 issued by the Government of India read with subsequent amendment/clarification thereof. Solar Energy Corporation of India Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/387-AT-2024.pdf",
    "date_of_order": "31.01.2025",
    "date_of_posting": "31.01.2025",
    "category": "Adoption"
  },
  {
    "serial_number": "54",
    "petition_number": "365/AT/2024",
    "subject": "Petition under Section 63 read with Section 79(1)(k) of the Electricity Act, 2003 for the adoption of tariff for Long Term Procurement of Solar Power of 300 MW from Grid Connected Project under tariff Based Competitive Bidding for meeting Renewable Purchase Obligation (RPO) as per applicable regulations, which has been discovered through a transparent process by way of competitive bidding conducted in terms of the competitive bidding guidelines issued by the Ministry of Power. CESC Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/365-AT-2024.pdf",
    "date_of_order": "31.01.2025",
    "date_of_posting": "31.01.2025",
    "category": "Adoption"
  },
  {
    "serial_number": "53",
    "petition_number": "346/AT/2024",
    "subject": "Petition under Section 63 of the Electricity Act, 2003 for the adoption of the tariff of 450 MW Solar Power Projects (Tranche XVI) connected to the Inter-State Transmission System and selected through competitive bidding process as per the Guidelines dated 28.7.2023 of the Ministry of Power, Government of India. Solar Energy Corporation of India Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/346-AT-2024.pdf",
    "date_of_order": "31.01.2025",
    "date_of_posting": "31.01.2025",
    "category": "Adoption"
  },
  {
    "serial_number": "52",
    "petition_number": "324/TL/2024",
    "subject": "Application under Sections 14 & 15 of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission Licence and other related matters) Regulations, 2024 with respect to grant of Transmission Licence to POWERGRID Beawar-Mandsaur Transmission Limited. POWERGRID Beawar - Mandsaur Transmission Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/324-TL-2024.pdf",
    "date_of_order": "31.01.2025",
    "date_of_posting": "31.01.2025",
    "category": "Licence (Transmission)"
  },
  {
    "serial_number": "51",
    "petition_number": "189/MP/2024",
    "subject": "Petition under section 79(1)(b) & (f) of the Electricity Act, 2003 read with Chapter IV of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 and Article 17 of the power purchase agreements dated 25.11.2021 seeking an appropriate adjustment/compensation to offset financial/ commercial impact of change in law events on account of increase in the rate of goods and services tax from 5% to 12% / 18% by way of notification no. 8/2021- Central tax (rate) dated 30.09.2021 and grant of consequential relief thereto along with affidavit. M/s Beempow Energy Private Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/189-MP-2024.pdf",
    "date_of_order": "29.01.2025",
    "date_of_posting": "29.01.2025",
    "category": "Misc."
  },
  {
    "serial_number": "50",
    "petition_number": "90/TT/2024",
    "subject": "Approval under Regulation 86 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 1999 and the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 for the determination of transmission tariff from the COD to 31.3.2024 for the transmission asset: 1x500 MVA, 400/220 kV ICT (3rd) at 400/220 kV Sohawal (PG) Sub-station under “1x500 MVA, 400/220 kV ICT Augmentation (3rd) at Sohawal (PG) under System Strengthening” in the Northern Region. PGCIL",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/90.pdf",
    "date_of_order": "27.01.2025",
    "date_of_posting": "27.01.2025",
    "category": "Transmission"
  },
  {
    "serial_number": "49",
    "petition_number": "381/TT/2024",
    "subject": "Petition for the truing up of transmission tariff for the 2019-24 period and the determination of transmission tariff for the 2024-29 period for 765 kV Single Circuit Kurnool-Raichur Transmission Line along with associated bay extensions at 765/400 kV Kurnool Sub-station and 765/400 kV Raichur Sub-station under the “System Strengthening Scheme-XXII” in Southern Region under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and under Regulation 15(1)(a) and Regulation 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 read with the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024. PGCIL",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/381.pdf",
    "date_of_order": "27.01.2025",
    "date_of_posting": "27.01.2025",
    "category": "Transmission"
  },
  {
    "serial_number": "48",
    "petition_number": "17/MP/2023",
    "subject": "Petition under Section 79(1)(b) and Section 79(1)(f) of the Electricity Act, 2003 read with Article 13 and Article 17 of the Power Purchase Agreement dated 7.8.2008 (as amended vide amendment agreements dated 17.9.2008 and 27.5.2022) executed between the Petitioner and Uttar Haryana Bijli Vitran Nigam Limited & Dakshin Haryana Bijli Vitran Nigam Limited; as well as Article 13 and Article 17 of the Power Purchase Agreement dated 20.1.2009 (as amended vide amendment agreement dated 21.10.2010) between the Petitioner and Tata Power Trading Company Limited inter alia seeking approval of Change in Law event, i.e., enactment of the Integrated Goods and Services Tax Act, 2017, the Central Goods and Services Tax Act, 2017, the State Goods And Services Tax Act, 2017, and the Union Territory Goods and Services Tax Act 2017; and compensation for additional expenses incurred by the Petitioner with respect to operation and maintenance of the Project on account of the same along with carrying cost. Jhajjar Power Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/17-MP-2023.pdf",
    "date_of_order": "22.01.2025",
    "date_of_posting": "23.01.2025",
    "category": "Misc."
  },
  {
    "serial_number": "47",
    "petition_number": "119/AT/2024",
    "subject": "Petition under Section 63 of the Electricity Act, 2003 for the adoption of usage charges for 1990 MW Solar Photovoltaic (PV) Power Station (Tranche –III) connected to the Inter-State Transmission System and selected through a competitive bidding process under Central Power Sector Undertaking Scheme Phase-II dated 05.03.2019 as per the Standard Bidding Guidelines of MoP dated 03.08.2017. 1. NTPC Limited, 2. NTPC Renewable Energy Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/119-AT-2024.pdf",
    "date_of_order": "22.01.2025",
    "date_of_posting": "23.01.2025",
    "category": "Adoption"
  },
  {
    "serial_number": "46",
    "petition_number": "400/TT/2024",
    "subject": "Approval under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and under Regulation 15(1)(a) and Regulation 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 and truing up of transmission tariff for the 2019-24 period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and determination of transmission tariff of the 2024-29 tariff period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024 for the Combined Asset under Installation of Reactors in Western Region. Power Grid Corporation of India Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/400-TT-2024.pdf",
    "date_of_order": "21.01.2025",
    "date_of_posting": "22.01.2025",
    "category": "Transmission"
  },
  {
    "serial_number": "45",
    "petition_number": "399/TT/2024",
    "subject": "Approval under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and under Regulation 15(1)(a) and Regulation 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 for truing up of transmission tariff for the 2019-24 tariff period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and determination of transmission tariff for the 2024-29 tariff period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024 for Hassan-Mysore 400 kV D/C transmission line and extension of 400/220 kV Hassan and Mysore Sub-station under “System Strengthening-IX” in the Southern Region. Power Grid Corporation of India Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/399-TT-2024.pdf",
    "date_of_order": "20.01.2025",
    "date_of_posting": "22.01.2025",
    "category": "Transmission"
  },
  {
    "serial_number": "44",
    "petition_number": "394/TT/2024",
    "subject": "Petition for the truing up of transmission tariff for the 2019-24 period and the determination of transmission tariff for the 2024-29 period for Spare Converter Transformer for Vizag back to back HVDC terminal in Southern Region under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and under Regulation 15(1)(a) and Regulation 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 read with the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024. Power Grid Corporation of India Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/394-TT-2024.pdf",
    "date_of_order": "20.01.2025",
    "date_of_posting": "22.01.2025",
    "category": "Transmission"
  },
  {
    "serial_number": "43",
    "petition_number": "393/TT/2024",
    "subject": "Approval under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and under Regulations 15(1)(a) and 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 for truing up of transmission tariff for the 2019-24 tariff period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and the determination of transmission tariff of the 2024-29 tariff period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024 for Special Energy Meters in Southern Region. Power Grid Corporation of India Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/393-TT-2024.pdf",
    "date_of_order": "20.01.2025",
    "date_of_posting": "22.01.2025",
    "category": "Transmission"
  },
  {
    "serial_number": "42",
    "petition_number": "377/TT/2024",
    "subject": "Petition for the truing up of transmission tariff for the 2019-24 period and the determination of transmission tariff for the 2024-29 period for NCC Generation Switchyard to Nellore Pooling Station and associated bays under “Transmission System for Connectivity for NCC Power Projects Limited” in Southern Region under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and under Regulation 15(1)(a) and Regulation 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 read with the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024. Power Grid Corporation of India Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/377-TT-2024.pdf",
    "date_of_order": "20.01.2025",
    "date_of_posting": "22.01.2025",
    "category": "Transmission"
  },
  {
    "serial_number": "41",
    "petition_number": "356/TT/2024",
    "subject": "Petition for the truing up of transmission tariff for the 2019-24 period and the determination of transmission tariff for the 2024-29 period for provision of Spare ICTs and Reactors for the Southern Region forming part of provision of Spare ICTs and Reactors for Eastern, Northern, Southern and Western Regions under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and under Regulation 15(1) (a) and Regulation 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 read with the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024. Power Grid Corporation of India Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/356-TT-2024.pdf",
    "date_of_order": "20.01.2025",
    "date_of_posting": "22.01.2025",
    "category": "Transmission"
  },
  {
    "serial_number": "40",
    "petition_number": "93/TT/2023",
    "subject": "Approval under Regulation 86 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 1999, and the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 for the determination of transmission tariff from COD to 31.3.2024 of Asset 1: Shifting of 400 kV, 125 MVAr Bus Reactor to Patna end in 400 kV Barh-II Line at Patna Sub-station as switchable line reactor along-with associated bay and Asset 2: Installation of 1 No. 315 MVA, 400/220 kV ICT at Farakka along with associated bays under “Eastern Region Strengthening Scheme-XII\" in Eastern Region. Power Grid Corporation of India Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/93-TT_2023.pdf",
    "date_of_order": "20.01.2025",
    "date_of_posting": "22.01.2025",
    "category": "Transmission"
  },
  {
    "serial_number": "39",
    "petition_number": "264/GT/2021",
    "subject": "Petition for revision of tariff of Muzaffarpur Thermal Power Station Stage-I (220 MW) for the period 2014-19, after the truing up exercise. Kanti Bijlee Utpadan Nigam Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/264-GT-2021.pdf",
    "date_of_order": "22.01.2025",
    "date_of_posting": "22.01.2025",
    "category": "Generation"
  },
  {
    "serial_number": "38",
    "petition_number": "478/TL/2024",
    "subject": "The Petition filed under Section 14 of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 for grant of separate RTM Transmission Licence to POWERGRID Bikaner Neemrana Transmission Limited.478-TL-2024_I POWERGRID Bikaner Neemrana Transmission Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/478-TL-2024_I.pdf",
    "date_of_order": "20.01.2025",
    "date_of_posting": "22.01.2025",
    "category": "Licence (Transmission)"
  },
  {
    "serial_number": "37",
    "petition_number": "7/RP/2024",
    "subject": "Review Petition under Section 94 of the Electricity Act, 2003 read with Section 114 of the Code of Civil Procedure, 1908, and Regulation 52 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 seeking review of the order dated 18.1.2024 passed in Petition No.114/MP/2019. 1. GMR Energy Trading Limited, 2. GMR Warora Energy Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/7-RP-2024.pdf",
    "date_of_order": "20.01.2025",
    "date_of_posting": "21.01.2025",
    "category": "Review"
  },
  {
    "serial_number": "36",
    "petition_number": "375/TT/2024",
    "subject": "Approval under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and under Regulations 15(1)(a) and 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 for truing up of transmission tariff for the 2019-24 tariff period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and the determination of transmission tariff of the 2024-29 tariff period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024 for 2nd Spare Converter Transformers at Kolar and Talcher of Talcher-Kolar HVDC Link in Southern Region. Power Grid Corporation of India Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/375-TT-2024.pdf",
    "date_of_order": "20.01.2025",
    "date_of_posting": "21.01.2025",
    "category": "Transmission"
  },
  {
    "serial_number": "35",
    "petition_number": "397/TT/2024",
    "subject": "Approval under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and under Regulation 15(1)(a) and Regulation 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 for truing up of transmission tariff for the 2019-24 tariff period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and determination of transmission tariff for the 2024-29 tariff period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024 for Thermal Powertech Corporation India Ltd. Switchyard to Nellore Pooling Station 400 kV D/C (quad) Line along with associated bay extensions at Nellore Pooling Station under “Transmission System for connectivity of Thermal Powertech Corporation India Ltd.” in the Southern Region. Power Grid Corporation of India Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/397-TT-2024.pdf",
    "date_of_order": "19.01.2025",
    "date_of_posting": "21.01.2025",
    "category": "Transmission"
  },
  {
    "serial_number": "34",
    "petition_number": "401/TT/2024",
    "subject": "Approval under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and under Regulation 15(1)(a) and Regulation 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 and truing up of transmission tariff for the 2019-24 period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and the determination of transmission tariff of the 2024-29 tariff period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024 for installation of 1X315 MVA 400/220 kV Autotransformer (ICT-III) along with associated bays at 400/220 kV Vapi (POWERGRID) Substation in Western Region. Power Grid Corporation of India Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/401-TT-2024.pdf",
    "date_of_order": "18.01.2025",
    "date_of_posting": "21.01.2025",
    "category": "Transmission"
  },
  {
    "serial_number": "33",
    "petition_number": "349/TT/2023",
    "subject": "Approval under Regulation 86 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 1999 and the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2014 and the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 for truing up of transmission tariff for the 2014-19 tariff period and determination of the transmission tariff for the 2019-24 tariff period for Assets under “Transmission System Associated with Parbati-III HEP” in the Northern Region. Power Grid Corporation of India Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/349-TT-2023.pdf",
    "date_of_order": "20.01.2025",
    "date_of_posting": "20.01.2025",
    "category": "Transmission"
  },
  {
    "serial_number": "32",
    "petition_number": "427/AT/2024",
    "subject": "Application under Section 63 of the Electricity Act, 2003, for the adoption of Transmission Charges with respect to the Transmission System being established by Navinal Transmission Limited. Navinal Transmission Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/427-AT-2024.pdf",
    "date_of_order": "18.01.2025",
    "date_of_posting": "20.01.2025",
    "category": "Adoption"
  },
  {
    "serial_number": "31",
    "petition_number": "424/TL/2024",
    "subject": "Petition under Sections 14, 15 and 79(1)(e) of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission Licence and other related matters) Regulations, 2024 with respect to grant of Transmission Licence to Jamnagar Transmission Limited. Jamnagar Transmission Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/424-TL-2024_I.pdf",
    "date_of_order": "18.01.2025",
    "date_of_posting": "20.01.2025",
    "category": "Licence (Transmission)"
  },
  {
    "serial_number": "30",
    "petition_number": "426/TL/2024",
    "subject": "Petition under Sections 14, 15, and 79(1)(e) of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission Licence and other related matters) Regulations, 2024 with respect to grant of Transmission Licence to Navinal Transmission Limited. Navinal Transmission Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/426-TL-2024-I.pdf",
    "date_of_order": "18.01.2025",
    "date_of_posting": "20.01.2025",
    "category": "Licence (Transmission)"
  },
  {
    "serial_number": "29",
    "petition_number": "477/TL/2024",
    "subject": "Petition under Section 14 of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 for grant of separate RTM Transmission License to POWERGRID Neemuch Transmission System Limited. POWERGRID Neemuch Transmission System Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/477-TL-2024_I.pdf",
    "date_of_order": "17.01.2025",
    "date_of_posting": "20.01.2025",
    "category": "Licence (Transmission)"
  },
  {
    "serial_number": "28",
    "petition_number": "503/MP/2024",
    "subject": "Petition under Section 79(1)(c) of the Electricity Act, 2003 read with Regulations 41 and 42 of the Central Electricity Regulatory Commission (Connectivity and General Network Access to the inter-State Transmission System) Regulations, 2022 inter alia seeking relaxation of the conditions stipulated for submission of documents pertaining to Financial Closure Tata Power Renewable Energy Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/503-MP-2024.pdf",
    "date_of_order": "16.01.2025",
    "date_of_posting": "18.01.2025",
    "category": "Misc."
  },
  {
    "serial_number": "27",
    "petition_number": "281/TD/2024",
    "subject": "Application under Section 14 and Section 15(1) of the Electricity Act, 2003 read with Regulation 6 of the Central Electricity Regulatory Commission (Procedure, Terms and Conditions for grant of trading licence and other related matters) Regulations, 2020 for grant of an inter-state trading licence. REC Power Development & Consultancy Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/281-TD-2024.pdf",
    "date_of_order": "14.01.2025",
    "date_of_posting": "17.01.2025",
    "category": "Licence"
  },
  {
    "serial_number": "26",
    "petition_number": "340/TL/2024",
    "subject": "Petition under Sections 14, 15 and 79(1)(e) of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission Licence and other related matters) Regulations, 2024 for grant of Transmission Licence with respect to the Transmission System to be implemented by Khavda IV C Power Transmission Limited. Khavda IV C Power Transmission Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/340-TL-2024.pdf",
    "date_of_order": "14.01.2025",
    "date_of_posting": "17.01.2025",
    "category": "Licence (Transmission)"
  },
  {
    "serial_number": "25",
    "petition_number": "432/MP/2024",
    "subject": "Petition under Sections 17(3) & 17(4) of Electricity Act, 2003 seeking approval for creation of security interest over all of the Petitioner’s Assets in favour of Respondent No. 2 (as the Security Trustee acting for the benefit of the Lender (as defined in the Petition) in respect of the Petitioner’s transmission project. KPS1 Transmission Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/432-MP-2024.pdf",
    "date_of_order": "14.01.2025",
    "date_of_posting": "17.01.2025",
    "category": "Misc."
  },
  {
    "serial_number": "24",
    "petition_number": "342/AT/2024",
    "subject": "Application under Section 63 of the Electricity Act, 2003 for the adoption of transmission charges with respect to the Transmission System being established by Bhadla-III & Bikaner-III Transmission Limited. POWERGRID Bhadla Bikaner Transmission Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/342-AT-2024.pdf",
    "date_of_order": "14.01.2025",
    "date_of_posting": "17.01.2025",
    "category": "Adoption"
  },
  {
    "serial_number": "23",
    "petition_number": "343/TL/2024",
    "subject": "Petition under Sections 14 & 15 of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission Licence and other related matters) Regulations, 2024 with respect to the Transmission Licence to POWERGRID Bhadla Bikaner Transmission Limited. POWERGRID Bhadla Bikaner Transmission Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/343-TL-2024-F.pdf",
    "date_of_order": "14.01.2025",
    "date_of_posting": "15.01.2025",
    "category": "Licence (Transmission)"
  },
  {
    "serial_number": "22",
    "petition_number": "34/RP/2023 in 237/GT/2020",
    "subject": "Review of Commission’s Order dated 26.07.2023 in Petition No. 237/GT/2020 for truing up of tariff of Ramagundam STPS Stage-I&II (2100 MW) for the period from 1.4.2014 to 31.3.2019. NTPC Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/34-RP-2023.pdf",
    "date_of_order": "12.01.2025",
    "date_of_posting": "13.01.2025",
    "category": "Review"
  },
  {
    "serial_number": "21",
    "petition_number": "15/TT/2023",
    "subject": "Approval under Regulation 86 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 1999 and determination of transmission tariff from COD to 31.3.2024 under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 in respect of Asset-1: Bypassing of 400 kV D/C Farakka - Kahalgaon (Ckt-3 & Ckt-4) and 400 kV S/C Farakka - Durgapur (Ckt-1 & Ckt-2) existing transmission line from NTPC, Farakka so as to form 400 kV D/C Kahalgaon - Durgapur along with upgraded bays at Durgapur Sub-station and Kahalgaon Sub-station, Asset-2: 01 No. 500 MVA, 400/220 kV Transformer (4th ICT) along with 01 No. 400 kV ICT bay (AIS) and 01 No. 220 kV ICT bay (GIS) along with 220 kV cable from ICT to GIS bay at Muzaffarpur (POWERGRID) 400/220 kV Sub-station and Asset-3: LILO of both circuits of Kishanganj (POWERGRID) -Darbhanga (DMTCL) 400 kV D/C (Quad) Line at Saharsa New (POWERGRID) Sub-station along with associated 04 nos. 400 kV line bays at Saharsa New (POWERGRID) Sub-station under “Eastern Region Strengthening Scheme-XXIII\" in the Eastern Region. Power Grid Corporation of India Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/15-TT-2023.pdf",
    "date_of_order": "11.01.2025",
    "date_of_posting": "13.01.2025",
    "category": "Transmission"
  },
  {
    "serial_number": "20",
    "petition_number": "390/TT/2023",
    "subject": "Approval under Regulation 86 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 1999 and the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 for the determination of transmission tariff from COD to 31.3.2024 for Asset-1: 400 kV D/C Mohindergarh-Bhiwani Transmission Line along with communication equipment at both ends and OPGW in place of one earth wire under “Northern Region System Strengthening Scheme (NRSSS)-XXXV” in the Northern Region and Asset-2: 2 Nos. 400 kV line bays at Bhiwani (POWERGRID) Substation under the “Construction of two Nos. 400 kV line bays at Bhiwani (POWERGRID) Substation” scheme in the Northern Region. Power Grid Corporation of India Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/390-TT-2023.pdf",
    "date_of_order": "11.01.2025",
    "date_of_posting": "13.01.2025",
    "category": "Transmission"
  },
  {
    "serial_number": "19",
    "petition_number": "370/TT/2024",
    "subject": "Petition for the truing-up of transmission tariff for the 2019-24 period and the determination of transmission tariff for the 2024-29 period for a transmission asset under “Western Region System Strengthening Scheme-XIII (WRSS-XIII)” under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and under Regulations 15(1)(a) and 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 read with the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024. Power Grid Corporation of India Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/370-TT-2024.pdf",
    "date_of_order": "11.01.2025",
    "date_of_posting": "13.01.2025",
    "category": "Transmission"
  },
  {
    "serial_number": "18",
    "petition_number": "369/TT/2024",
    "subject": "Approval under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and under Regulation 15(1)(a) and Regulation 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 for the truing-up of transmission tariff for the 2019-24 period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff Regulations, 2019 and for the determination of transmission tariff for the 2024-29 period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024 and for Combined Asset comprising of Asset-I comprising of Combined Elements of: (a) 30% FSC on 400 kV Bareilly-Mandola Ckt. 1 and Ckt. 2 at Bareilly, (b) 45% FSC on 400 kV D/C Unnao-Bareilly Ckt. 1 and Ckt. 2 at Unnao and (c) 30% FSC on 400 kV Gorakhpur-Lucknow Ckt. 1 at Lucknow and Asset-II: 30% FSC on 400 kV Gorakhpur-Lucknow Ckt. 2 at Lucknow under “System associated with Enhancement of Transmission Capacity of East-West Corridor of the Northern Region”. Power Grid Corporation of India Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/369-TT-2024.pdf",
    "date_of_order": "11.01.2025",
    "date_of_posting": "13.01.2025",
    "category": "Transmission"
  },
  {
    "serial_number": "17",
    "petition_number": "434/MP/2024",
    "subject": "Petition under Section 79 (1) (c) of the Electricity Act 2003, read with Regulations 41 and 42 of the CERC (Connectivity and General Network Access to the Inter-State Transmission System) Regulations, 2022, and the relevant provisions of the Conduct of Business Regulations, 2023. Gujarat Energy Transmission Corporation Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/434-MP-2024.pdf",
    "date_of_order": "11.01.2025",
    "date_of_posting": "13.01.2025",
    "category": "Misc."
  },
  {
    "serial_number": "16",
    "petition_number": "29/RP/2024 in 113/MP/2020 along with IA No. 89/2024",
    "subject": "Petition under section 94(1)(f) of the Electricity Act, 2003 read with Regulation 52 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 and section 114 and order 47 rule 1 of the code of civil procedure, 1908 seeking review of order dated 20.01.2024 passed by this Commission in Petition No.113/MP/2020. Central Transmission Utility of India Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/29-RP-2024.pdf",
    "date_of_order": "06.01.2025",
    "date_of_posting": "09.01.2025",
    "category": "Review"
  },
  {
    "serial_number": "15",
    "petition_number": "01/SM/2025",
    "subject": "Recovery of legacy dues in the Deviation Settlement Mechanism (DSM) Pool Account in pursuance of DSM Regulations, 2024 - Regarding.",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/01-SM-2025.pdf",
    "date_of_order": "08.01.2025",
    "date_of_posting": "08.01.2025",
    "category": "Suo-Motu"
  },
  {
    "serial_number": "14",
    "petition_number": "374/TT/2024",
    "subject": "Approval for the truing-up of transmission tariff for the 2019-24 period and the determination of transmission tariff for the 2024-29 period for the Combined Asset under “System Strengthening–VIII in Southern Regional Grid” under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and under Regulations 15(1)(a) and 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 read with the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024. Power Grid Corporation of India Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/374-TT-2024.pdf",
    "date_of_order": "08.01.2025",
    "date_of_posting": "08.01.2025",
    "category": "Transmission"
  },
  {
    "serial_number": "13",
    "petition_number": "10/SM/2024",
    "subject": "Methodology for Transition from Six-Monthly Escalation Rates to Monthly Escalation Rates for Imported Coal.",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/10-SM-2024.pdf",
    "date_of_order": "02.01.2025",
    "date_of_posting": "06.01.2025",
    "category": "Suo-Motu"
  },
  {
    "serial_number": "12",
    "petition_number": "382/TT/2024",
    "subject": "Approval under Section 62 read with Section 79 (1) (d) of the Electricity Act, 2003 and under Regulation 15 (1) (a) and Regulation 23 of Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 for truing up of the transmission tariff for the 2019-24 tariff period under the Central Electricity Regulatory Commission (Terms and Condition of Tariff) Regulations, 2019 and the determination of transmission tariff of the 2024-29 tariff period under the Central Electricity Regulatory Commission (Terms and Condition of Tariff) Regulations, 2024 for Bhadrawati-Chandrapur 400 kV D/C transmission line including bays at Bhadrawati (Powergrid) Switching Station (Extensions) and Chandrapur (MSEB) Switchyard in Western Region. Power Grid Corporation of India Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/382-TT-2024.pdf",
    "date_of_order": "03.01.2025",
    "date_of_posting": "06.01.2025",
    "category": "Transmission"
  },
  {
    "serial_number": "11",
    "petition_number": "358/TT/2024",
    "subject": "Approval for the truing-up of transmission tariff for the 2019-24 period and the determination of transmission tariff for the 2024-29 period for the combined asset under “Transmission System associated with Contingency plan for evacuation of power from IL&FS (2x600 MW)” in Southern Region under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and under Regulations 15(1)(a) and 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 read with the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024. Power Grid Corporation of India Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/358-TT-2024.pdf",
    "date_of_order": "03.01.2025",
    "date_of_posting": "06.01.2025",
    "category": "Transmission"
  },
  {
    "serial_number": "10",
    "petition_number": "437/TL/2024",
    "subject": "The Petition filed under Section 14 of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 for grant of separate RTM Transmission License to POWERGRID Bhadla III Transmission Limited. POWERGRID Bhadla III Transmission Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/437-TL-2024_I.pdf",
    "date_of_order": "03.01.2025",
    "date_of_posting": "06.01.2025",
    "category": "Licence (Transmission)"
  },
  {
    "serial_number": "09",
    "petition_number": "337/GT/2014",
    "subject": "Revision of tariff of Sipat Super Thermal Power Station, Stage-I (1980 MW) for the period 2009-14 and 2014-19- Implementation of the judgements of APTEL. NTPC Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/337-GT-2014.pdf",
    "date_of_order": "05.01.2025",
    "date_of_posting": "06.01.2025",
    "category": "Generation"
  },
  {
    "serial_number": "08",
    "petition_number": "340/GT/2014",
    "subject": "Revision of tariff of Korba Super Thermal Power Station, Stage-III (500 MW) for the periods 2009-14 and 2014-19- Implementation of the judgements of APTEL. NTPC Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/340-GT-2014.pdf",
    "date_of_order": "05.01.2025",
    "date_of_posting": "06.01.2025",
    "category": "Generation"
  },
  {
    "serial_number": "07",
    "petition_number": "21/RP/2024 in 54/MP/2024",
    "subject": "Review of Order dated 05.04.2024 passed by this Commission in Petition No. 54/MP/2024 under Section 94(1)(f) of the Electricity Act, 2003 read with Regulation 103 of the CERC (Conduct of Business) Regulations,1999 and Order 47 Rule 1 of the Code of Civil Procedure, 1908 Khandukhal Rampura Transmission Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/21-RP-2024.pdf",
    "date_of_order": "03.01.2025",
    "date_of_posting": "06.01.2025",
    "category": "Review"
  },
  {
    "serial_number": "06",
    "petition_number": "92/MP/2024 with IA.No.36/2024",
    "subject": "Petition under Section 79 (1) (c), (f) and (k) of the Electricity Act, 2003 read with Regulation 41 & 42 of the Central Electricity Regulatory Commission (Connectivity and General Network Access to the inter-State Transmission System) Regulations, 2022 for an appropriate decision on the submission of Payment on Order Instrument in lieu of Connectivity Bank Guarantee. Indosol Solar Private Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/92-MP-2024.pdf",
    "date_of_order": "03.01.2025",
    "date_of_posting": "06.01.2025",
    "category": "Misc."
  },
  {
    "serial_number": "05",
    "petition_number": "204/MP/2023",
    "subject": "Petition under Section 79 of the Electricity Act, 2003 for approval of ‘Change in Law’ on account of financial/ commercial impact of the ‘Change in Law’ event i.e., increase in the rate of Goods and Services Tax from 5% to 12 % by way of Notification No. 8/2021- Central Tax (Rate) dated 30.09.2021 issued by Ministry of Finance, Government of India, in terms of Article 12 of the Power Purchase Agreement executed with Solar Energy Corporation of India Limited. M/s. Morjar Windfarm Development Private Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/204-MP-2023.pdf",
    "date_of_order": "03.01.2025",
    "date_of_posting": "06.01.2025",
    "category": "Misc."
  },
  {
    "serial_number": "04",
    "petition_number": "347/TL/2024",
    "subject": "Application under Sections 14, 15, 79(1)(e) of the Electricity Act, 2003 read with the Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 seeking transmission licence for Tumkur-II REZ Power Transmission Limited. Tumkur- II REZ Power Transmission Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/347-TL-2024.pdf",
    "date_of_order": "02.01.2025",
    "date_of_posting": "03.01.2025",
    "category": "Licence (Transmission)"
  },
  {
    "serial_number": "03",
    "petition_number": "383/TT/2024",
    "subject": "Approval under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and under Regulations 15(1)(a) and 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 and truing up of transmission tariff for the 2019-24 period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and the determination of transmission tariff of the 2024-29 tariff period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024 for combined asset under Ramagundam Stage-III Transmission System in Southern Region. Power Grid Corporation of India Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/383-TT-2024.pdf",
    "date_of_order": "02.01.2025",
    "date_of_posting": "03.01.2025",
    "category": "Transmission"
  },
  {
    "serial_number": "02",
    "petition_number": "280/GT/2014",
    "subject": "Approval of tariff of Farakka Super Thermal Power Station, Stage-III (500 MW) for the period 2014-19-Implementation of the judgments of APTEL NTPC Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/280-GT-2014.pdf",
    "date_of_order": "02.01.2025",
    "date_of_posting": "03.01.2025",
    "category": "Generation"
  },
  {
    "serial_number": "01",
    "petition_number": "138/AT/2024",
    "subject": "Petition under Section 63 of the Electricity Act, 2003 for adoption of tariff for Pilot Projects of 500 MW/1000MWh Standalone Battery Energy Storage Systems in India under Tariff-Based Global Competitive Bidding (ESS-I) process as per the guidelines of the Government of India Solar Energy Corporation of India Limited",
    "pdf_link": "https://www.cercind.gov.in/2025/orders/138-AT-2024.pdf",
    "date_of_order": "02.01.2025",
    "date_of_posting": "03.01.2025",
    "category": "Adoption"
  }
]